Revit 2026 API

# ExternalFileUtilsGetAllExternalFileReferences Method

---

Gets the ids of all elements which are external file references.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> GetAllExternalFileReferences(
	Document aDoc
)
```
```vb
Public Shared Function GetAllExternalFileReferences (
	aDoc As Document
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ GetAllExternalFileReferences(
	Document^ aDoc
)
```
```fsharp
static member GetAllExternalFileReferences :
        aDoc : Document -> ICollection<ElementId>
```

#### Parameters

aDoc Document
     A Revit Document.

#### Return Value

ICollectionElementId The ids of all elements which are external file references.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function will not return the ids of nested Revit links; it only returns top-level references.

#### Reference

ExternalFileUtils Class

Autodesk.Revit.DB Namespace